<a href="https://colab.research.google.com/github/karthikkandi/PYHTON/blob/main/pandas_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
nba=pd.read_csv('nba.csv')       #its gonna read the nba file
#nba.head()               #it printts the frst five entries
nba.tail(10)               #prints the final ten entries.

               Name       Team  Number  ... Weight   College      Salary
448  Gordon Hayward  Utah Jazz    20.0  ...  226.0    Butler  15409570.0
449     Rodney Hood  Utah Jazz     5.0  ...  206.0      Duke   1348440.0
450      Joe Ingles  Utah Jazz     2.0  ...  226.0       NaN   2050000.0
451   Chris Johnson  Utah Jazz    23.0  ...  206.0    Dayton    981348.0
452      Trey Lyles  Utah Jazz    41.0  ...  234.0  Kentucky   2239800.0
453    Shelvin Mack  Utah Jazz     8.0  ...  203.0    Butler   2433333.0
454       Raul Neto  Utah Jazz    25.0  ...  179.0       NaN    900000.0
455    Tibor Pleiss  Utah Jazz    21.0  ...  256.0       NaN   2900000.0
456     Jeff Withey  Utah Jazz    24.0  ...  231.0    Kansas    947276.0
457             NaN        NaN     NaN  ...    NaN       NaN         NaN

[10 rows x 9 columns]

In [ ]:
#nba.index        #gives number of entries.
#nba.shape        #gives the dimensions in rows and columns.
#nba.dtypes       #gives the data types.
#nba.columns       #gives the columns title. 
#nba.axes          #gives the end points and the step values. 
#nba.info
nba.info()        #gives the complete infromation.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

# shared method and column access in pandas

In [ ]:
import pandas as pd
rev=pd.read_csv('revenue.csv', index_col='Date')     #replace the index colunnm with date.
rev.head()

        New York  Los Angeles  Miami
Date
1/1/16       985          122    499
1/2/16       738          788    534
1/3/16        14           20    933
1/4/16       730          904    885
1/5/16       114           71    253

In [ ]:
rev.sum() #Here data is added in terms of column wise
#rev.sum(axis=0)    #gives the sum of elements of first column.
#rev.sum(axis='index')

NameError: ignored

In [ ]:
 rev.sum(axis=1)
rev.sum(axis='columns')    #gives the sums of the colmns.

Date
1/1/16     1606
1/2/16     2060
1/3/16      967
1/4/16     2519
1/5/16      438
1/6/16     1935
1/7/16     1234
1/8/16     2313
1/9/16     2623
1/10/16     555
dtype: int64

In [ ]:
nba=pd.read_csv('nba.csv')
nba.head()

#If i want to extract data column wise
# type(nba.Salary) #Its data type is series as it is a single dimension array it works properly when there is no space in column name

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0                NaN  5000000.0

[5 rows x 9 columns]

In [ ]:
# nba['Name'] #It is more accurate as it works for those column also which have space in there name
nba.Name

# Add new column to data frames

In [ ]:
import pandas as pd
nba=pd.read_csv('nba.csv')             #read the nba.csv file. 
nba.head()

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0                NaN  5000000.0

[5 rows x 9 columns]

In [ ]:
nba['Sports']='Basket Ball' #One method to add column but by this column is added at the last
nba.head()

            Name            Team  ...     Salary       Sports
0  Avery Bradley  Boston Celtics  ...  7730337.0  Basket Ball
1    Jae Crowder  Boston Celtics  ...  6796117.0  Basket Ball
2   John Holland  Boston Celtics  ...        NaN  Basket Ball
3    R.J. Hunter  Boston Celtics  ...  1148640.0  Basket Ball
4  Jonas Jerebko  Boston Celtics  ...  5000000.0  Basket Ball

[5 rows x 10 columns]

In [ ]:
 
nba=pd.read_csv('nba.csv')
#Insert method : any specific place you may add your column
nba.insert(3, column="League", value="IPL")   #insert ipl from 3 column
nba.League[[0,1]]=["Hello","test"]   #insert hello index and test in 0 and 1 respectively
nba.head()

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0                NaN  5000000.0

[5 rows x 10 columns]

# BroadCasting operation in pandas

In [ ]:
#Broadcasting : means to perform operation in whole series of a column
import pandas as pd
nba=pd.read_csv('nba.csv')
nba.head()

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0                NaN  5000000.0

[5 rows x 9 columns]

In [ ]:
nba['Salary'].sub(50000)
# nba['Salary']-50000      #deduct 50000 from the corresponding sallary.


# nba['Age'].add(5)
# nba['Age']+5              #add 5 to the age of everyone


# nba['Weight'].mul(0.453)
# nba['Weight']*0.453           #gonna multiply 0.453 to every weight



nba["Weight in KG"]=nba['Weight']*0.453592
nba.head()

            Name            Team  ...     Salary Weight in KG
0  Avery Bradley  Boston Celtics  ...  7730337.0    81.646560
1    Jae Crowder  Boston Celtics  ...  6796117.0   106.594120
2   John Holland  Boston Celtics  ...        NaN    92.986360
3    R.J. Hunter  Boston Celtics  ...  1148640.0    83.914520
4  Jonas Jerebko  Boston Celtics  ...  5000000.0   104.779752

[5 rows x 10 columns]

# Drops Rows with Null Values

In [ ]:
import pandas as pd
nba=pd.read_csv('nba.csv')      #reads the last five entries of the file
nba.head()

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0                NaN  5000000.0

[5 rows x 9 columns]

In [ ]:
nba.tail()   #print the lasst five five entries

             Name       Team  Number Position  ...  Height Weight  College     Salary
453  Shelvin Mack  Utah Jazz     8.0       PG  ...     6-3  203.0   Butler  2433333.0
454     Raul Neto  Utah Jazz    25.0       PG  ...     6-1  179.0      NaN   900000.0
455  Tibor Pleiss  Utah Jazz    21.0        C  ...     7-3  256.0      NaN  2900000.0
456   Jeff Withey  Utah Jazz    24.0        C  ...     7-0  231.0   Kansas   947276.0
457           NaN        NaN     NaN      NaN  ...     NaN    NaN      NaN        NaN

[5 rows x 9 columns]

In [ ]:
nba.dropna()
nba.dropna(how='any', inplace = True)
nba.dropna(how='all', inplace=True)
nba.tail()

NameError: ignored

In [ ]:
nba.dropna(axis=1, inplace=True) #It deletes column which consists NaN
nba.head()

            Name            Team  Number Position   Age Height  Weight
0  Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1    Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2   John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
3    R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0
4  Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

In [ ]:
nba.dropna(subset=['Salary'])

# fillna method for Null Values

In [ ]:
import pandas as pd
nba=pd.read_csv('nba.csv')
nba.head()

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0                NaN  5000000.0

[5 rows x 9 columns]

In [ ]:
nba.fillna(0).head()               #fill 0 where  there is NaN

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        0.0
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0                  0  5000000.0

[5 rows x 9 columns]

In [ ]:
nba['Salary']
nba['Salary'].fillna(0, inplace=True)     #fill o in place of NaN
nba.head()

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        0.0
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0                NaN  5000000.0

[5 rows x 9 columns]

In [ ]:
nba['College'].fillna('No College', inplace=True)      #fill NaN with no college.
nba

              Name            Team  ...            College     Salary
0    Avery Bradley  Boston Celtics  ...              Texas  7730337.0
1      Jae Crowder  Boston Celtics  ...          Marquette  6796117.0
2     John Holland  Boston Celtics  ...  Boston University        0.0
3      R.J. Hunter  Boston Celtics  ...      Georgia State  1148640.0
4    Jonas Jerebko  Boston Celtics  ...         No College  5000000.0
..             ...             ...  ...                ...        ...
453   Shelvin Mack       Utah Jazz  ...             Butler  2433333.0
454      Raul Neto       Utah Jazz  ...         No College   900000.0
455   Tibor Pleiss       Utah Jazz  ...         No College  2900000.0
456    Jeff Withey       Utah Jazz  ...             Kansas   947276.0
457            NaN             NaN  ...         No College        0.0

[458 rows x 9 columns]

# sort_values() method in Data Frames

In [ ]:
import pandas as pd
nba=pd.read_csv('nba.csv')          #read the file nba.csv
nba.head()

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0                NaN  5000000.0

[5 rows x 9 columns]

In [ ]:
nba.sort_values('Name', ascending=False).head()             #sort in descending values of their names.

                Name                    Team  ...         College      Salary
237    Zaza Pachulia        Dallas Mavericks  ...             NaN   5200000.0
271    Zach Randolph       Memphis Grizzlies  ...  Michigan State   9638555.0
402      Zach LaVine  Minnesota Timberwolves  ...            UCLA   2148360.0
270   Xavier Munford       Memphis Grizzlies  ...    Rhode Island         NaN
386  Wilson Chandler          Denver Nuggets  ...          DePaul  10449438.0

[5 rows x 9 columns]

In [ ]:

nba.sort_values('Age')
nba.sort_values('Age', ascending=False)    #sort the data in descending order of thier age.

               Name                    Team  ...         College     Salary
304    Andre Miller       San Antonio Spurs  ...            Utah   250750.0
400   Kevin Garnett  Minnesota Timberwolves  ...             NaN  8500000.0
298      Tim Duncan       San Antonio Spurs  ...     Wake Forest  5250000.0
261    Vince Carter       Memphis Grizzlies  ...  North Carolina  4088019.0
102  Pablo Prigioni    Los Angeles Clippers  ...             NaN   947726.0
..              ...                     ...  ...             ...        ...
401      Tyus Jones  Minnesota Timberwolves  ...            Duke  1282080.0
60   Christian Wood      Philadelphia 76ers  ...            UNLV   525093.0
226   Rashad Vaughn         Milwaukee Bucks  ...            UNLV  1733040.0
122    Devin Booker            Phoenix Suns  ...        Kentucky  2127840.0
457             NaN                     NaN  ...             NaN        NaN

[458 rows x 9 columns]

In [ ]:
nba.sort_values('Salary') #NaN values would arrange at the end
# nba.sort_values('Salary', na_position='last')    #
nba.sort_values('Salary', na_position='first')

                Name                 Team  ...            College      Salary
2       John Holland       Boston Celtics  ...  Boston University         NaN
46       Elton Brand   Philadelphia 76ers  ...               Duke         NaN
171    Dahntay Jones  Cleveland Cavaliers  ...               Duke         NaN
264    Jordan Farmar    Memphis Grizzlies  ...               UCLA         NaN
269     Ray McCallum    Memphis Grizzlies  ...            Detroit         NaN
..               ...                  ...  ...                ...         ...
339       Chris Bosh           Miami Heat  ...       Georgia Tech  22192730.0
251    Dwight Howard      Houston Rockets  ...                NaN  22359364.0
33   Carmelo Anthony      New York Knicks  ...           Syracuse  22875000.0
169     LeBron James  Cleveland Cavaliers  ...                NaN  22970500.0
109      Kobe Bryant   Los Angeles Lakers  ...                NaN  25000000.0

[458 rows x 9 columns]

# sortvalues() for multi columns in pandas

In [ ]:
import pandas as pd
nba=pd.read_csv('nba.csv')
nba.head()

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0                NaN  5000000.0

[5 rows x 9 columns]

In [ ]:
nba.sort_values(['Team', 'Name'])
# nba.sort_values(['Team', 'Name'], ascending=[True,False])        #SORT THE FOLOOWING IN THE ORDER OF THIR TEAM AND NAME

                Name                Team  ...       College      Salary
312       Al Horford       Atlanta Hawks  ...       Florida  12000000.0
318  Dennis Schroder       Atlanta Hawks  ...           NaN   1763400.0
323      Jeff Teague       Atlanta Hawks  ...   Wake Forest   8000000.0
309    Kent Bazemore       Atlanta Hawks  ...  Old Dominion   2000000.0
311     Kirk Hinrich       Atlanta Hawks  ...        Kansas   2854940.0
..               ...                 ...  ...           ...         ...
376  Markieff Morris  Washington Wizards  ...        Kansas   8000000.0
375     Nene Hilario  Washington Wizards  ...           NaN  13000000.0
378  Otto Porter Jr.  Washington Wizards  ...    Georgetown   4662960.0
379   Ramon Sessions  Washington Wizards  ...        Nevada   2170465.0
457              NaN                 NaN  ...           NaN         NaN

[458 rows x 9 columns]

# rank() method in pandas

In [ ]:
import pandas as pd
nba=pd.read_csv('nba.csv').dropna(how='all')
nba['Salary']=nba['Salary'].fillna(0).astype('int')
nba.head()

            Name            Team  Number  ... Weight            College   Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        0
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0      Georgia State  1148640
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0                NaN  5000000

[5 rows x 9 columns]

In [ ]:
#I want to decide on the basis of salary, that whose salary is highest comes at rank 1 and so on..
nba['Salary'].rank()
# nba['Salary'][91]
nba['Salary'].rank(ascending=False).astype(int)
nba['Salary Rank']=nba['Salary'].rank(ascending=False).astype(int)
nba.sort_values(by='Salary', ascending=False)
# nba.head()

                Name                    Team  ...    Salary Salary Rank
109      Kobe Bryant      Los Angeles Lakers  ...  25000000           1
169     LeBron James     Cleveland Cavaliers  ...  22970500           2
33   Carmelo Anthony         New York Knicks  ...  22875000           3
251    Dwight Howard         Houston Rockets  ...  22359364           4
339       Chris Bosh              Miami Heat  ...  22192730           5
..               ...                     ...  ...       ...         ...
353    Dorell Wright              Miami Heat  ...         0         452
264    Jordan Farmar       Memphis Grizzlies  ...         0         452
409       Greg Smith  Minnesota Timberwolves  ...         0         452
273   Alex Stepheson       Memphis Grizzlies  ...         0         452
270   Xavier Munford       Memphis Grizzlies  ...         0         452

[457 rows x 10 columns]

# Filtering DataFrames in pandas

In [ ]:
import pandas as pd
df=pd.read_csv('employees.csv')
df.head()

  First Name  Gender Start Date  ... Bonus %  Senior Management             Team
0    Douglas    Male   8/6/1993  ...   6.945               True        Marketing
1     Thomas    Male  3/31/1996  ...   4.170               True              NaN
2      Maria  Female  4/23/1993  ...  11.858              False          Finance
3      Jerry    Male   3/4/2005  ...   9.340               True          Finance
4      Larry    Male  1/24/1998  ...   1.389               True  Client Services

[5 rows x 8 columns]

In [ ]:
df.info() #at the end size is there, when we look at the output it is claer that start date and last login time data type is object, but actually they are object iof adte time same as in Senior management has object type but actually it is bool and if correct data type is not there then more memory is required

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [ ]:
df['Start Date']

0        8/6/1993
1       3/31/1996
2       4/23/1993
3        3/4/2005
4       1/24/1998
          ...
995    11/23/2014
996     1/31/1984
997     5/20/2013
998     4/20/2013
999     5/15/2012
Name: Start Date, Length: 1000, dtype: object

In [ ]:
# pd.to_datetime(df['Start Date'])
df['Start Date']=pd.to_datetime(df['Start Date'])

In [ ]:
df['Last Login Time'].head()

0    12:42 PM
1     6:53 AM
2    11:17 AM
3     1:00 PM
4     4:47 PM
Name: Last Login Time, dtype: object

In [ ]:
# pd.to_datetime(df['Last Login Time'])
df['Last Login Time']=pd.to_datetime(df['Last Login Time'])

In [ ]:
df['Senior Management']=df['Senior Management'].astype(bool)

In [ ]:
df['Gender']=df['Gender'].astype('category')

In [ ]:
df.info()                                 #GIVES THE INFORATION PROVIDED

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    category
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), category(1), datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 49.0+ KB

In [ ]:
#date time can be converted by attribute parse_date available in read_csv method
import pandas as pd
df=pd.read_csv('employees.csv', parse_dates=['Start Date', 'Last Login Time'])
df['Gender']=df['Gender'].astype('category')
df['Senior Management']=df['Senior Management'].astype('bool')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    category
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), category(1), datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 49.0+ KB

# Filtering a dataframe based on condition

In [ ]:
import pandas as pd
df=pd.read_csv('employees.csv', parse_dates=['Start Date', 'Last Login Time'])
df['Gender']=df['Gender'].astype('category')
df['Senior Management']=df['Senior Management'].astype('bool')
df.head()

  First Name  Gender Start Date  ... Bonus %  Senior Management             Team
0    Douglas    Male 1993-08-06  ...   6.945               True        Marketing
1     Thomas    Male 1996-03-31  ...   4.170               True              NaN
2      Maria  Female 1993-04-23  ...  11.858              False          Finance
3      Jerry    Male 2005-03-04  ...   9.340               True          Finance
4      Larry    Male 1998-01-24  ...   1.389               True  Client Services

[5 rows x 8 columns]

In [ ]:
#If i want to apply condition on gender that i want only those value in gender series which are of male category
# df['Gender']
df['mask']=df['Gender']=='Male'
# df
# df[mask]
# df[df['Gender']=='Female'] #This will extract only those value in a column whose value are male

In [ ]:
mask1=df['Team']=='Finance'
mask2=df['Gender']=='Male'

# df['Filter']=df[mask1 & mask2]
df[mask1]
df[df['Team']=='Finance']

    First Name  Gender Start Date  ... Senior Management     Team   mask
2        Maria  Female 1993-04-23  ...             False  Finance  False
3        Jerry    Male 2005-03-04  ...              True  Finance   True
7          NaN  Female 2015-07-20  ...              True  Finance  False
14    Kimberly  Female 1999-01-14  ...              True  Finance  False
46       Bruce    Male 2009-11-28  ...             False  Finance   True
..         ...     ...        ...  ...               ...      ...    ...
907  Elizabeth  Female 1998-07-27  ...             False  Finance  False
954        Joe    Male 1980-01-19  ...              True  Finance   True
987     Gloria  Female 2014-12-08  ...              True  Finance  False
992    Anthony    Male 2011-10-16  ...              True  Finance   True
996    Phillip    Male 1984-01-31  ...             False  Finance   True

[102 rows x 9 columns]

In [ ]:
mask=df['Senior Management']
# df[df['Senior Management']] #As senior management data is already in boolean so it can be done directly'
df[mask]

    First Name  Gender Start Date  ... Senior Management             Team   mask
0      Douglas    Male 1993-08-06  ...              True        Marketing   True
1       Thomas    Male 1996-03-31  ...              True              NaN   True
3        Jerry    Male 2005-03-04  ...              True          Finance   True
4        Larry    Male 1998-01-24  ...              True  Client Services   True
6         Ruby  Female 1987-08-17  ...              True          Product  False
..         ...     ...        ...  ...               ...              ...    ...
991       Rose  Female 2002-08-25  ...              True        Marketing  False
992    Anthony    Male 2011-10-16  ...              True          Finance   True
993       Tina  Female 1997-05-15  ...              True      Engineering  False
994     George    Male 2013-06-21  ...              True        Marketing   True
999     Albert    Male 2012-05-15  ...              True            Sales   True

[535 rows x 9 columns]

In [ ]:
mask= df['Team'] != 'Marketing'
df[mask]
# df[df['Team'] != 'Marketing'] #condition for not equal to.

In [ ]:
df[df['Salary']>110000]

# Filter Data Frame with AND & OR Operators

In [ ]:
import pandas as pd
df=pd.read_csv('employees.csv', parse_dates=['Start Date', 'Last Login Time'])
df['Gender']=df['Gender'].astype('category')
df['Senior Management']=df['Senior Management'].astype('bool')
df.head()

In [ ]:
mask1=df['Gender']=='Male'
mask2=df['Team']=='Marketing'

df[mask1 & mask2]

df[mask1 & mask2].head()

In [ ]:
mask3=df['Senior Management']
mask4=df['Start Date']< '1990-01-01'

df[mask3 | mask4]

In [ ]:
mask5=df['First Name']=='Robert'
mask6=df['Team']=='Client Services'
mask7=df['Start Date']>'2016-06-01'

df[(mask5 & mask6) | mask7]

# isin() method in pandas

In [ ]:
import pandas as pd
df=pd.read_csv('employees.csv', parse_dates=['Start Date', 'Last Login Time'])
df['Gender']=df['Gender'].astype('category')
df['Senior Management']=df['Senior Management'].astype('bool')
df.head()

In [ ]:
mask1=df['Team']=='Legal'
mask2=df['Team']=='Sales'
mask3=df['Team']=='Product'

df[mask1 | mask2 | mask3].head()

In [ ]:
#As in above case it is claer that it requires same code for many times so it can be deal with the help of isin() method as in this case we are able to pass multiple arguments

df['Team'].isin(['Legal', 'Sales', 'Product'])

In [ ]:
mask=df['Team'].isin(['Legal', 'Sales', 'Product'])
df[mask] #It is claer that we does not required multiple lines of asme type

# isnull(), notnull() ,between() and duplicate() method in panda

In [ ]:
import pandas as pd
df=pd.read_csv('employees.csv', parse_dates=['Start Date', 'Last Login Time'])
df['Gender']=df['Gender'].astype('category')
df['Senior Management']=df['Senior Management'].astype('bool')
df.head()

In [ ]:
#isnull() if you want to extract null values
mask=df['Team'].isnull()
df[mask]

In [ ]:
mask1=df['Team'].isnull()
mask2=df['Gender'].isnull()


df [ mask1 & mask2]
# df[df['Team'].notnull()]

In [ ]:
#between()
# df['Salary'].between(60000, 70000)
df[df['Salary'].between(60000, 70000)]

In [ ]:
df['Bonus %'].between(2.0, 5.0)
df[df['Bonus %'].between(2.0, 5.0)]

In [ ]:
df['Start Date'].between("1991-01-01", "1992-01-01")
df[df['Start Date'].between("1991-01-01", "1992-01-01")]

In [ ]:
#duplicate() method
df.sort_values('First Name', inplace=True)
# df['First Name']=df.sort_values('First Name')
df['First Name']

In [ ]:
df['First Name'].duplicated(keep='last') #it says that first value is not duplicate as in parameter it has keep=first you may change it to last also

In [ ]:
 df[df['First Name'].duplicated(keep=False)].head()

In [ ]:
mask = ~ df[df['First Name'].duplicated(keep=False)].head() #reverse operation of duplicate so ir gives unique value from data sets

In [ ]:
#drop duplicate method\
len(df)

In [ ]:
len(df.drop_duplicates())

In [ ]:
df.drop_duplicates(subset=['First Name'], keep='first')
len( df.drop_duplicates(subset=['First Name'], keep='first'))

In [ ]:
df.drop_duplicates(subset=['First Name', 'Team'], keep='last').head()

# Retrieve row values using loc() method in pandas

In [ ]:
import pandas as pd
bond=pd.read_csv('jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head()

In [ ]:
bond.loc['Casino Royale']

In [ ]:
bond.loc['GoldenEye']

In [ ]:
bond.loc['Casino Royale']

In [ ]:
bond.loc['Diamonds are Forever': 'Moonracker']
bond.loc['GoldenEye':]
bond.loc[: "On Her Majesty's Secret Services"]

In [ ]:
bond.loc[["For Your Eyes Only", "Live and Let Die"]]

#  Retrieve row values using iloc() method in pandas

In [ ]:
import pandas as pd
bond=pd.read_csv('jamesbond.csv')
bond.head()

In [ ]:
# bond.loc[15]
bond.iloc[15]

In [ ]:
bond.iloc[[15,20]]
bond.iloc[:4]
bond.iloc[4:8]
bond.iloc[0:20:2]

# Retrive row values using ix() methods in pandas

In [ ]:
# In case of ix it has both the capability of loc and iloc
import pandas as pd
bond=pd.read_csv('jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head()

In [ ]:
bond.loc['GoldenEye']
bond.ix['GoldenEye']

In [ ]:
bond.ix[[ 'Moonraker', 'Spectre']]

In [ ]:
'Spectre' in bond.index
'Sacred Bond' in bond.index
bond.index
bond.values

In [ ]:
bond.ix[0] #It shows that ix will be taken data as loc and iloc both

# Second argument of iloc, loc and ix methods

In [ ]:
import pandas as pd
bond=pd.read_csv('jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head()

In [ ]:
bond.loc['Moonraker', 'Actor']
# bond.loc['Moonraker', 'Director']
# bond.loc['Moonraker', 'Actor':'Budget']
bond.loc['Moonraker', ['Year', 'Director', 'Budget']]
# #Similarly we can use it with iloc and ix

# Set new values or a specific cell or Row in pandas

In [ ]:
import pandas as pd
bond=pd.read_csv('jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head()

In [ ]:
bond.ix['Dr. No']

In [ ]:
#For eg i want to change the name of the actor
bond.ix['Dr. No', 'Actor']='Sir Sean Connery'
bond.ix['Dr. No', 'Actor']

In [ ]:
bond.ix['Dr. No', ['Box Office', 'Budget', 'Bond Actor Salary']]=[470, 9, 6]

In [ ]:
bond.ix['Dr. No']

# Set Multiple values in DataFrames in pandas

In [ ]:
import pandas as pd
bond=pd.read_csv('jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head()

In [ ]:
mask=bond['Actor']=='Sean Connery'
bond[mask]

In [ ]:
bond[mask]['Actor']='Sir Sean Connery'

In [ ]:
df2=bond[mask]
df2['Actor']='Sir Sean Connery'
df2

In [ ]:
bond

In [ ]:
bond.ix[mask]
bond.ix[mask,'Actor']='Sir Sean Connery'
bond

# Rename Index Labels or Columns in pandas

In [ ]:
import pandas as pd
bond=pd.read_csv('jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head()

In [ ]:
bond.rename(columns={'Year':'Release date', 'Box Office' : 'Revenue'}, inplace=True)
bond.head()

In [ ]:
bond.rename(index={'Dr. No':'Doctor No', 'GoldenEye':'Golden Eye','The World Is Not Enough': 'Best Bond Movie'})

# Query Methods in Pandas

In [ ]:
#Query methods only applys when all the column are strings and no space in between columns name

import pandas as pd
bond=pd.read_csv('jamesbond.csv', index_col='Film')
bond.sort_index(inplace=True)
bond.head()

In [ ]:
bond.columns=[column_names.replace(" ",  "_") for column_names in bond.columns]
bond.head()

In [ ]:
bond.query('Actor=="Sean Connery"')

In [ ]:
bond.query("Director=='Terence Young'")

In [ ]:
bond.query("Actor != 'Roger Moore'")

In [ ]:
bond.query("Box_Office>600")

In [ ]:
bond.query("Actor=='Roger Moore' and Director=='John Glen'")